# Vertices Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..Vertices Property
Mesh Class See Also
---
Retrieves all vertices used to define this mesh. Intended for indexed access.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<XYZ> Vertices { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Vertices As IList(Of XYZ)
	Get
```

Visual C++
---
```text
public:
property IList<XYZ^>^ Vertices {
	IList<XYZ^>^ get ();
}
```

# See Also
Mesh Class
Autodesk.Revit.DB Namespace